<?php

return [

    'filters' => [
        'index' => 'Фильтры',
        'create' => 'Добавление фильтра',
        'empty' => 'Нет записей',
        'edit' => 'Редактирование фильтра',

        'fields' => [
            'id' => 'ID',
            'title' => 'Заголовок',
        ],
    ],

    'product-categories' => [
        'index' => 'Категории товаров',
        'create' => 'Добавление категории',
        'empty' => 'Нет записей',
        'edit' => 'Редактирование категории',

        'fields' => [
            'id' => 'ID',
            'title' => 'Заголовок',
            'parent_id' => 'Родительская категория',
            'slug' => 'Машинное имя',
            'content' => 'Описание',
            'filters' => 'Фильтры',
            'seo_description' => 'SEO Описание',
            'seo_title' => 'SEO Заголовок',
            'seo_keywords' => 'SEO Ключевые слова',
        ],

        'hints' => [
            'filter_title' => 'Название фильтра',
        ],
    ],

    'product-brands' => [
        'index' => 'Бренды товаров',
        'create' => 'Добавление бренда',
        'empty' => 'Нет записей',
        'edit' => 'Редактирование бренда',

        'fields' => [
            'id' => 'ID',
            'title' => 'Заголовок',
            'content' => 'Описание',
            'seo_description' => 'SEO Описание',
            'seo_title' => 'SEO Заголовок',
            'seo_keywords' => 'SEO Ключевые слова',
        ],

        'hints' => [
        ],
    ],

    'products' => [
        'index' => 'Товары',
        'create' => 'Добавление товара',
        'empty' => 'Нет записей',
        'edit' => 'Редактирование товара',

        'fields' => [
            'id' => 'ID',

            'product_brand_id' => 'Бренд (Производитель)',
            'slug' => 'Машинное-имя',
            'article_number' => 'Артикул',
            'price' => 'Цена',
            'price_new' => 'Цена акционная',
            'quantity' => 'Кол-во',
            'type' => 'Тип',
            'rating' => 'Рейтинг',
            'is_hot' => 'Продвигаемый товар',
            'status' => 'Статус видимости',

            'title' => 'Заголовок',
            'content' => 'Описание',
            'delivery' => 'Доставка',
            'preparing' => 'Предпродажная подготовка',
            'review' => 'Обзор',
            'warranty_short' => 'Гарантия (краткое описание)',
            'warranty' => 'Гарантия (полное описание)',
            'additional' => 'Запасные части',

            'seo_description' => 'SEO Описание',
            'seo_title' => 'SEO Заголовок',
            'seo_keywords' => 'SEO Ключевые слова',
        ],

        'hints' => [
            'title' => 'Наименование товара',
            'delivery' => 'Условия доставки. Текст будет отображен на странице карточки товара, в пункте "Доставка"',
        ],
    ],

    'actions' => [
        'apply' => 'Применить',
        'delete_selected' => 'Удалить выбранные',
        'create' => 'Создать',
    ],

];
